Repository: seanpm2001/mt-training-data
Catalog: ss/ss_pontoon.tmx
Source language: en_us
Languages: ss

source: 2 down, keep it up!<playIcon></playIcon>
ss: 2 phasi, wente kahle! <playIcon></playIcon>

source: ≥ 2 No votes
ss: 2 wema voti latsi Cha

source: ≥ 2 Yes votes
ss: 2 wema voti latsi Yebo

source: Abbreviations and Acronyms. Abbreviations and acronyms like “USA” or “ICE” should be avoided in the source text because they may be read in a way that does not coincide with their spelling. Additionally, there may be multiple accurate readings for a single abbreviation. For example, the acronym “ICE” could be pronounced “I-C-E” or as a single word.
ss: Tifinyeto kanye netibekisa magama. Tifinyeto netibekisa magama tifana nekutsi “USA” noma “ICE” kufanele kugwenywe kulomtfombo wemagama ngoba tingafundzeka ngendlela lengahambisani nendlela lebhalwa ngayo. Kwengeta, kungase kube nekufundvwa lokungiko lokuningi kwesifinyeto sinye. Sibonelo, sifinyeto lesitsi "ICE" singabitwa ngekutsi "I-C-E" noma njengeligama linye.

source: About
ss: Mayelana

source: Accent
ss: Indlela yekukhuluma lulwimi

source: Account
ss: i-Account

source: <accuracyLink>See more on accuracy criteria.</accuracyLink>
ss: <accuracyLink> Bona lokunengi eluhleni lwekungaphazami </accuracyLink>

source: { $actionType }<playIcon></playIcon> did they accurately speak the sentence?
ss: { $actionType }<playIcon></playIcon> bawukhulume kahle lomusho?

source: { $actionType }<recordIcon></recordIcon> then read the sentence aloud
ss: { $actionType }<recordIcon></recordIcon>fundza lomusho uphumisele

source: { $actionType }<stopIcon></stopIcon> when done
ss: { $actionType }<stopIcon></stopIconuma> socedzile

source: { $actionType } submit when ready
ss: { $actionType } mikisa uma ulungele

source: Add
ss: Ngeta

source: Add a language you want to contribute to
ss: Ngeta lulwimi lofuna kulekelela kulo

source: Add as much information as you can about the language. This could include:
ss: Ngeta imininingwane leminengi ngalolulwimi. Loku kungafaka ekhatsi:

source: Adding languages to work with
ss: Kungeta tilwimi lotosebenta ngato

source: Additional Language
ss: Lulwimi lolungetiwe

source: Add Language
ss: Ngeta Lulwimi

source: <addLink>Add more sentences now!</addLink>
ss: *[other] { $count } Ngeta imisho manje!</addLink>

source: Add new custom accent "{ $inputValue }"
ss: Ngeta indlela yakho lensha yekukhuluma "{ $inputValue }"

source: Add new sentences
ss: Ngeta imisho lemisha

source: Add Sentences
ss: Ngeta imisho

source: Add <wikipediaLink>public domain</wikipediaLink> sentences
ss: Ngeta <wikipediaLink>public domain</wikipediaLink> Imisho

source: Add Your Voice
ss: Ngeta Livi Lakho

source: Age
ss: Iminyaka yekutalwa

source: All
ss: Konkhe

source: All sentences you submit must be under <wikipediaLink>Public Domain (CC-0) license</wikipediaLink>. To support the inclusion of work not under public licence, we have created a <cc0WaiverLink>Contributions Agreement template</cc0WaiverLink> for works where the copyright owner would like to contribute the material to Common Voice.
ss: Yonkhe imisho loyimikisako kumele ibe ngephansi <wikipediaLink>kwemvume ye Public Domain (CC-0) </wikipediaLink>. Kusekela umsebenti longekho phanse mvumo yemphakatsi, sakhe <cc0WaiverLink>umfanekiso weSivumelwane Sekunikela</cc0WaiverLink> lesitosebenta uma umnikwati we copyright afuna kunikela ku Common Voice.

source: All voice clips in the dataset are scrubbed of personally identifying information. When a contributor provides demographic data via their profile, that information is de-identified from their voice clips before being bundled for download in the dataset and is never made public on their profile page.
ss: Tonkhe ticeshana temavi latfwebuliwe tisuswa yonkhe imininingwane yemnikati uma lonikelako afaka lwati lwetibalo ngelikhasi lakhe, lolo lwati luyasuswa buniyo kuleticeshana temavi ngaphambilini kwekutsi tingasetjentwa futsi atifike esiveni ekhasi labo.

source: Anonymized user data like age, gender, and accent helps improve the audio data used to train the accuracy of speech recognition engines. Your username and email will never be associated with your submitted data, and you can choose whether to make your username public or anonymous.
ss: Lwati lolufihlakele njenge mnyaka, bulili kanye netici tisita kutfutfukisa lwati msindvo lolubese lusetjentiswa kucecesha tinjini teftu tebucwephesha tekuva emagama. Ligama lolisebentisile ne email ngeke kuhlanganiswe nelwati lolutfomele futsi ungakhetsa kutsi lelogama latiwe sive noma uligcine liyimfihlo.

source: Approve
ss: Vumela

source: A quiet background hubbub is OK, but we don’t want additional voices that may cause a machine algorithm to identify words that are not in the written text. If you can hear distinct words apart from those of the text, the clip should be rejected. Typically this happens where the TV has been left on, or where there is a conversation going on nearby.
ss: Ihabhu lengemuva lephansi ilungile, kodvwa asiwafuni emavi lengatiwe langase abangele i-algorithm yemshini kutsi ibone emagama langekho kulokubhaliwe. Uma uva emagama lahlukene ngaphandle kwalawo embhalo, lesiceshana kufanele sijikiswe. Ngalokuvamile loku kwenteka lapho i-TV ishiywe ivuliwe, noma lapho kunenkhulumo lechubekako edvute.

source: Are you coming? <strong>[called by another]</strong>
ss: Uyeta? <strong>[lokubitwe ngulomunye]</strong>

source: Ask about a new language
ss: Buta ngelulwimi lolusha

source: Avatar
ss: Sitfombe

source: Average
ss: Lokusemkhatsini

source: A voice clip is marked "valid" when a user gives it a Yes vote.
ss: Livi lelitfwebuliwe limakwa "valid" uma livotelwa Yebo.

source: Avoid too much background noise - it should be easy to hear you.
ss: Gwema imisindvo ngemuva- kumele kube lula kukuva.

source: Awards
ss: Imiklomelo

source: Back
ss: Emuva

source: Background Noise
ss: Imisindvo lengemuva

source: Background Voices
ss: Emavi langemuva

source: Back to Top
ss: Buyela Etulu

source: Be cautious before rejecting a clip on the ground that the reader has mispronounced a word, has put the stress in the wrong place, or has apparently ignored a question mark. There are a wide variety of pronunciations in use around the world, some of which you may not have heard in your local community. Please provide a margin of appreciation for those who may speak differently from you.
ss: Caphela ngaphambi kwekutsi ucitse siceshana lapho lofundzako angakasho kahle ligama, noma ufake kucindzetela endzaweni lengasiyo, noma ke kungenteka ushiye umbuto. Tinengi tindlela tekusho letisetjentiswa mhlaba wonkhe, letinye longakativa emphakatsini wangakini. Sicela ufake umkhawulo wekubonga kulabo labakhuluma ngendlela lengafani neyakho.

source: Benefits
ss: Inzuzo

source: <bold>{ $count }</bold> Clips
ss: <bold>{ $count }</bold> Ticephu

source: <bold>Help us</bold> find more voices
ss: <bold>Sisite </bold>sitfole emavi lamanengi

source: Both
ss: Kokubili

source: Both (Speak and Listen)
ss: Kokubili (khuluma phindze ulalele)

source: Browse Languages
ss: Funa lulwimi

source: Build a custom goal
ss: Yakha ligoli lakho

source: Build Profile
ss: Yakha likhasi lelichaza kabanti ngawe

source: <b>Why an email?</b> We may need to contact you in the future about changes to the dataset, an email provides us a point of contact.
ss: <b>Leni i-email?<b>Kungenteka sidzinge kuchumana nawe esikhatsini lesitako ngelushintjo kulo mtfombo welwati, i-email ngiyo lesitochumana ngayo.

source: By editing your goal, you may lose your existing progress.
ss: Ngekulungisa umbhalo weligoli lakho, ungalahlakelwa yinchubo yakho.

source: By opting in to receive emails you state that you are okay with Mozilla handling this info as explained in Mozilla’s <privacyLink>Privacy Policy</privacyLink>.
ss: Ngekuvuma kutsi wemukela imiyaleto kusho kutsi ute inkinga yekutsi Mozilla ekuphatseni lolwati njengoba kuchaziwe ku Mozilla's<privacyLink>Privacy Policy</privacyLink>

source: <b>You agree</b> to not attempt to determine the identity of speakers in the Common Voice dataset
ss: <b>Uyavuma</b> kungazami kufuna kwati kabanti ngetikhulumi kule Dataset yaka Common Voice.

source: By providing some information about yourself, the audio data you submit to Common Voice will be more useful to Speech Recognition engines that use this data to improve their accuracy.
ss: Ngekunikela ngencenye yemininingwane ngawe, lolwati ngemsindvo lolitfumele ku Common Voice lutawusita kakhulu enjinini yekuva inkhulumo lesebentisa lolwati kute itfutfukise bucotfo.

source: By using Common Voice, you agree to our <termsLink>Terms</termsLink> and <privacyLink>Privacy Notice</privacyLink>
ss: Ngekusebentisa Common Voice, uyavumelana <termsLink>nemigomo yetfu</termsLink> ne<privacyLink>mibandzela</privacyLink>

source: Cancel Re-recording
ss: Yekela kutfwebula kabusha

source: Cancel Submission
ss: Yekela kumiskisa

source: Can't decide?
ss: Awukhoni kukhetsa?

source: Change your email via Settings under Login Identity
ss: Shintja liposi lakho lembane kuma settings ngaphasi kwalapho ungena khona

source: Check if your language is listed on the <languagesPageLink>Common Voice Languages page</languagesPageLink>. If not, fill out this form and we’ll <strong>send you a handy email explaining how to get your language set up</strong>.
ss: Hlola kutsi lulwimi lwakho lubaliwe yini<languagesPageLink> ekhasini letilwimi laka Common Voice</languagesPageLink>. Uma lungekho, gcwalisa nali lifomu tsine <strong>sitokutfumelela i-email sikuchezela kutsi ulifaka njani lulwimi lwakho</strong>.

source: <chevron></chevron>See less
ss: <chevron></chevron>Bona lokuncane

source: <chevron></chevron>See more
ss: <chevron></chevron>Bona lokunengi

source: Choose language/localization
ss: Khetsa Lulwimi/localization

source: Click
ss: Chafata

source: { $clipCount } voice clips, total archive size { $size }. Expires { $expires }.
ss: { $clipCount } emafayela emavi latfwebuliwe, linani lemafayela lagciniwe { $size }. Aphupha nini { $expires }.

source: Clips recorded
ss: Ticephu letiftwebuliwe

source: Clips Uploaded
ss: Ticephu leti-uploadiwe

source: Clips validated
ss: Ticephu leticinisikesiwe

source: Clips You've Recorded
ss: Ticeshana lotiftwebulile

source: Clips You've Validated
ss: Ticeshana Loticinisekisile

source: Close
ss: Vala

source: Collecting sentences
ss: Kukweleka imisho

source: Collecting sentences from the public domain, or writing new ones for the public domain.
ss: Kukwelekwa imisho ku public domain, noma kubhala lemasha uyibhalele i public domain.

source: Collect sentences
ss: Imisho lekwelekiwe

source: Comment
ss: Phawula

source: Common Voice data plus all other voice datasets above.
ss: i-data ya Common Voice nayo yonkhe i-dataset langenhla.

source: Common Voice is a crowdsourcing platform, and the languages were all added by volunteers. We would love for you to add your language! <languageRequestLink>Ask about adding your language.</languageRequestLink>
ss: i-Common Voice yindzawo yekutseklea lusito, futsi tonkhe tilwimi tangetwa ngema volontiya. Singakujabulela kutsi wengete lulwimi lwakho! <languageRequestLink> Buta ngekungeta lulwimi lwakho.</languageRequestLink>

source: Common Voice is Mozilla's initiative to help teach machines how real people speak.
ss: Common Voice lichaza lelidlalwa nguMozilla lelisita kufundzisa imishina kutsi bantfu mbamba bakhuluma kanjani.

source: Common Voice is part of Mozilla's initiative to help teach machines how real people speak.
ss: Common Voive uyincenye yetinsita ta Mozilla tekusita kufundzisa imishini kutsi bantfu mbamba bakhuluma njani.

source: Common Voice is the world’s largest publicly available, multi-language voice dataset.
ss: Common Voice yi dataset yekucala lenkhulu, lenetilwimi letinengi futsi levulekele sive sonkhe mhlaba wonkhe jikelele

source: Common Voice recordings are used by academics, small businesses, and voice recognition enthusiasts to help train and grow publicly available resources like voice models. Can you let us know why you would like your recordings deleted?
ss: Lokutfwebuliwe kwakha Common Voice kungasetjentiswa bafundzi, ema bhizinisi lamancane kanye nelabatsandva bucwephesha bemavi latfwebuliwe, kusita kucecesha nekukhulisa lwati loselukhona esiveni nje tinhlobo temavi. Sicela usatise kutsi leni ufuna kususa lokutfwebulile.

source: Community participation and decision making.
ss: Kutimbandzakanya kwemmango nekwenta tincumo.

source: Community Playbook
ss: Bhukwana wemmango

source: Confirm
ss: Vuma

source: Confirm Goal
ss: Cinisekisa umgomo

source: Confirm New Sentences
ss: Cinisekisa Imisho Lemisha

source: Contact
ss: Chumana

source: Contact Form
ss: Lifomu lekuchumana

source: Content available under a <licenseLink>Creative Commons license</licenseLink>
ss: Emafayela atfolakala phasi kwe <licenseLink>Creative Commons license</licenseLink>

source: Continue
ss: Chubeka

source: Contribute
ss: Nikela

source: Contribute sentences
ss: Nikela imisho

source: Contribute to { $lang }
ss: Nikela ku { $lang }

source: Contribute Your Voice
ss: Lekelela Ngelivi Lakho

source: Contribution Activity
ss: Imisebenti wekulekelela

source: Contribution Criteria
ss: Luhla lwekulekelela

source: Contribution Experience
ss: Sipiliyoni sekulekelela

source: Contributors record voice clips by reading from a bank of donated sentences.
ss: Labasitako batfwebula ticephu temavi ngekufundza ebhange lemisho lenikelwe.

source: <coquiLink>Coqui</coquiLink> is dedicated to open speech technology. Their projects include deep learning based STT and TTS engines.
ss: <coquiLink>Coqui</coquiLink>utimisele kuvula lobucwephesha lobu. Lomsebenti ufaka ekhatsi kufundza lokujilile ngetinjini te STT na TTS.

source: Could not add language
ss: Asikakhoni kungeta lulwimi

source: Could not change settings. Please try again.
ss: Ema settings akashintjeki. Sicela uphindze wetame futsi.

source: Could not remove language
ss: Asikakhoni kususa lulwimi

source: Could not remove language: language not found
ss: Lulwimi alukasuseki. lulwimi alukatfolakali

source: { $count } clips
ss: { $count } ticephu

source: { $countOfInvalidated } rejected by you
ss: { $countOfInvalidated } lajikiswe nguwe

source: { $countOfReviewed } sentences are already reviewed. Great job!
ss: { $countOfReviewed } imisho seyivele icinisekisiwe. Muhle umsebenti!

source: { $countOfSentences } sentences found.
ss: { $countOfSentences } imisho letfolakele.

source: { $countOfUnreviewed } sentences are unreviewed. If you want, you can also review your sentences now before submitting them.
ss: { $countOfUnreviewed }Imisho ayikabuyeketwa. Uma ufuna, ungayibuyeketa nyalo imisho ungakamikisi.

source: Create a Custom Goal
ss: Yakha ligoli lakho

source: Creating opportunities for a diversity of people to contribute to Common Voice ensures the dataset serves as many people as possible. We’ve created resources and templates that you can use!
ss: Kwakha ematfuba ebantfu labehlukahlukene kutolekelela ku Common Voice kusita kutsi lolwati lusite bantfu labanyenti. Sakhe tinsita netibonelo longatisebentisa!

source: Criteria
ss: Luhla

source: Croatian
ss: Si-Croatia

source: Daily Goal
ss: Umgomo welilanga

source: Dashboard
ss: i-Dashboard

source: Date
ss: Lusuku

source: Days
ss: Emalanga

source: De-identified
ss: Kususwe imininingwane yemniyo

source: Delete my recordings
ss: Yesula ticephu tami latitfwebuliwe

source: Delete Profile
ss: Yesula likhasi

source: Delete selected sentences
ss: Yesula imisho lekhetsiwe

source: Deleting selected sentences…
ss: Yesula imisho lekhetsiwe…

source: Different language
ss: Lulwimi lolwehlukile

source: Difficult
ss: Kulikhuni

source: Difficult to pronounce
ss: Kulukhuni kuyisho

source: Discard ongoing recording
ss: Lahla sicephu lesisatfwebulwa

source: Donate your voice
ss: Nikela livi lakho

source: Don't see your language on Common Voice yet?
ss: Awuliboni lulwimi lwakho ku Common voice kwamanje?

source: Don’t see your language reflected in the Dataset? To request a language head over to our Languages page.
ss: Lulwimi lwakho aluveli kule Dataset? Kucela lophetse lulwimi ekhasini letfu lelulwimi.

source: Do you have ideas on how we can make the Common Voice dataset better? Let us know on Discourse
ss: Unayo imibono lengenta Common Voice abe ncono? Satise ku Discourse.

source: Do you want to continue?
ss: Uyafuna kuchubeka?

source: Do you want to Speak, Listen or both?
ss: Ufuna kukhuluma, kulalela, noma kokubili?

source: Drag and drop or <browseWrap>Browse</browseWrap>
ss: Dvonsa futsi uyekele<browseWrap>Buka</browseWrap>

source: During contribution submission feedback will be skipped after clicking 'Submit'. Contribution will continue directly with the next set of 5 recordings or validations.
ss: Ngale sikhatsi setetfulo imibono utokweciwa emvakwekuchafata 'Submit'. Tetfulo titochubeka ngesicheme lesilandzelako salokutfwebuliliwe noma loku cinisekisiwe.

source: Each entry in the dataset consists of a unique MP3 and corresponding text file. Many of the <b>{ $total }</b> recorded hours in the dataset also include demographic metadata like age, sex, and accent that can help train the accuracy of speech recognition engines. The dataset currently consists of <b>{ $valid }</b> validated hours in <b>{ $languages }</b> languages, but we’re always adding more voices and languages. Take a look at our <languagesLink>Languages page</languagesLink> to request a language or start contributing.
ss: Ngakunye lokufakwako kulomtfombo kucukets i-MP3 leyehlukile kanye nelifayela lembhalo lelihambisana nayo.Lamaningi ema <b>{ $total }</b> lacoshiwe kulomtfombo wetfu afaka ekhatsi lwati lwe lwetibalo tebantu letifana neminyaka, bulili, nendlela yokukhuluma lengasita kucecesha bucoftfo kwetinjini tekuva inkhulumo. Lomtfombo welwati kwanyalo ucuketse <b>{ $valid }</b> amahora lacinisekisiwe <b>{ $languages }</b> tilwimi, kodvwa sihlala sengeta amavi netilimi. Buka <languagesLink>likhasi Tilwimi</languagesLink> kucela lulwimi noma ucale ukunikele.

source: Easy
ss: Kumelula

source: Edit
ss: Hlela

source: Edit Profile
ss: Lungisa likhasi lelichaza kabanti ngawe

source: Email
ss: I-imeyili

source: <emailFragment>Sign up</emailFragment> to our mailing list to learn how you can take part in campaigns, events and co-design features on Common Voice.
ss: <emailFragment>Bhalisa </emailFragment> ungene eluhlelweni lwetfu lwekuchumana utofundza kutsi ungawangenela kanjani ema campaigns, imicimbi kanye nema co-design features ku Common Voice

source: Email is already used for a different account
ss: Leliposi lembane selivele lisetjentiswe kulenye i-account

source: Email Subscriptions
ss: Lababhalise ngeliposi lembane

source: English
ss: Singisi

source: Enter Email to Download
ss: Faka i-email utokhona ku-download

source: Enter email to send a sign up link
ss: Faka liposi lembane kuze utfumele i-link yekubhalisa.

source: Enter your email
ss: I-imeyili yakho

source: Error { $code }
ss: Liphutsa { $code }

source: Error while fetching rejected sentences. Please try again.
ss: Kube neliphutsa sisalandza imisho lejikisiwe. Sicela uphindze wetame futsi.

source: Error while fetching your sentences. Please try again.
ss: Kube neliphutsa sisalandza imisho yakho. Sicela uphindze wetame futsi.

source: Events
ss: Imicimbi

source: Everyone
ss: Wonkhe muntfu

source: Exit & Delete clips
ss: Phuma phindze wesule ticephu letitfwebuliwe

source: Expert linguists can also help, try to reach out to local linguistic universities (both teachers and students) and see if they can help to gather a diverse set of sound-diverse sentences in your language.
ss: Bocwephesha betilwimi nabo bangasita, yetama kufinyelela kucwephesha wetilwimi lose nyuvesi yangakini (bo thishela kanye nebafundzi) bese uyabuka ke kutsi bangakhona yini ukhone ubutsanise imisho leyehlukahlukene.

source: Failed to delete selected sentences… Please try again!
ss: Sehlulekile kwesula imisho lekhetsiwe... Sicela uphindze wetame futsi!

source: Faroese
ss: si-Faroese

source: Female
ss: Wesifazane

source: Fields marked with an asterisk (*) are required.
ss: Tindzawo letimakwe ngenkhanyeti (*) tidzingekile.

source: Filtered sentences due to requirements failing (please submit fixed versions as new sentences):
ss: Imisho lesefiwe ngenca yekufeyila timfanelo (sicela umikise losekulungisiwe kube misho lemisha):

source: Finding existing sentences in the Public Domain
ss: Kutfola imisho levele ikhona ku Public Domain

source: Find others who care. That could be universities, language schools, advocacy groups or data science communities. Reach out and explain clearly how they can help and why. <outreachTemplates>See our template outreach emails</outreachTemplates>.
ss: Tfola labanye labane ndzaba. Labo kungaba manyuvesi,tikolwa tetilwimi, emacembu lamele imiphakatsi noma imphikatsi lebuke lwati. Fika kibo phindze uchaze kahle kutsi bangasitakala njani futsi leni. <outreachTemplates>Buka sibonelo ku -email yetfu</outreachTemplates>.

source: Finish editing first?
ss: Cedzela kulungisa kucala?

source: Finish recording
ss: Cedza kutfwebula

source: Finish recording first?
ss: Cedza kutfwebula kucala?

source: Finish Review
ss: Cedza kubuyeketa

source: First, check if your language <languageLink>already exists</languageLink>. If it isn’t, you can <languageRequestLink>ask about adding your language</languageRequestLink>. There are two stages. Translating the site, and collecting sentences
ss: Kwekucala, hlola kutsi lulwimi lwakho <languageLink> selukhona yini </languageLink>. Uma lungekho, <languageRequestLink>ungabuta ngekungeta lulwimi lwakho</languageRequestLink>. Kunetigaba. Kuhumusha lelikhasi nekukweleka imisho

source: Foreign letters. Letters must be valid in the language being spoken. For example, “ж” is a letter in the Russian alphabet but is never used in English and so should never appear in any English source text.
ss: Tincwadzi tekuhamba. Tincwadzi kumele tibe ngito ngetilwimi letikhulunywako. Kubekisa, kunenhlavu lekhona emagameni ase Russia konja akukameli asetjentiswe Esingisini futsi akukameli avele kumsuka we Sinigisi.

source: For every voice clip donated, and every audio clip validated, your account dashboards are updated to reflect your latest progress in each language you contribute to. Yes, you can contribute to more than one!<br/><br/> Use dashboards to track your stats, see how you're doing alongside others in the community, and set daily or weekly contribution goals.
ss: Kuso sonkhe siceshana selivi lesinikelwe, nato tonkhe ticeshana temsindvo leticinisekisiwe, likhasi lakho liyabuyeketwa kute kuvele inchubekela phambili yakho ngelulwimi ngalunye lonikela kulo. Yebo, unganikela ngalokungetulu kwakunye!<br/><br/> Sebentisa likhasi lakho kute ulandzelele tibalo takho, ubone kutsi wenta kanjani ngekuhambisana nalabanye emphakatsini, futsi ubeke imigomo yekunikela yemalanga onkhe noma emaviki.

source: for example
ss: kubekisa

source: For public domain text not available online, you could use academic referencing style e.g Harvard style "Jess (2021) My Public licence poems"
ss: Ngemininingwane yesive lengatfolakali online, ungasebentisa indlela yeku reference lesebentiswa etikolweni lefaka ekhatsi Harvard style "Jess (2021) My Public licence poems"
